
### :robot: Terraform Report
---
##### Plan: `1` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.control_plane must be replaced
-/+ resource "hcloud_server" "control_plane" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "nbg1-dc3" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "35660685" -> (known after apply)
      ~ ipv4_address               = "128.140.40.122" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:1c1c:427::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:1c1c:427::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "control-plane"
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "OU7RHLvppnj4zcqDSkrD0u3YbhM=" -> "PMuJFdGd6o2Ee2ExMev3rhUtovQ=" # forces replacement
        # (10 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ control_plane_ipv4_address = "128.140.40.122" -> (known after apply)

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#5778132954`](https://github.com/small-hack/modules-hetzner-tf-vm/actions/runs/5778132954) - commit e17605cee291da92007b729bbd066af979cb4740
